raohassandev/KC_PV_DG/firmware/esp32-s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_MQTT_BUFFER_SIZE=4096
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_MQTT_TRANSPORT_TCP=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
